In [1]:
import numpy as np
from scipy.stats import ttest_1samp, ttest_ind, mannwhitneyu, levene, shapiro,bartlett,wilcoxon,f_oneway #f_oneway is for anova
from statsmodels.stats.power import ttest_power
import pandas as pd
import scipy.stats as stats
from scipy.stats import chisquare,chi2_contingency
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
hr=pd.read_table('HR (1).txt',index_col=0)

In [4]:
hr.head()

,Attrition,Age,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
Individual,,,,,,,,,,,,,,,,,,,,,
Ind1,Yes,41,1,1102,1,1,2,1,1,1,...,1,80,0,8,0,1,6,4,0,5
Ind2,No,49,2,279,2,8,1,1,1,2,...,4,80,1,10,3,3,10,7,1,7
Ind3,Yes,37,1,1373,2,2,2,6,1,4,...,2,80,0,7,3,3,0,0,0,0
Ind4,No,33,2,1392,2,3,4,1,1,5,...,3,80,0,8,3,3,8,7,3,0
Ind5,No,27,1,591,2,2,1,2,1,7,...,4,80,1,6,3,3,2,2,2,2

In [5]:
hr.columns

Index(['Attrition', 'Age', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [6]:
# 1:verify years with current manager is a factor influencing attrition,if so further invetigate with suitable statistical test 
# with suitable evidence
# 2: education field with respect to attrition
# 3: number of companies worked

In [7]:
hr['YearsWithCurrManager'].value_counts()

2     344
0     263
7     216
3     142
8     107
4      98
1      76
9      64
5      31
6      29
10     27
11     22
12     18
13     14
17      7
14      5
15      5
16      2
Name: YearsWithCurrManager, dtype: int64

In [8]:
CT_hr=pd.crosstab(hr['Attrition'],hr['YearsWithCurrManager'])
CT_hr

YearsWithCurrManager,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17
Attrition,,,,,,,,,,,,,,,,,,
No,178,65,294,123,87,27,25,185,97,58,24,21,18,14,3,5,2,7
Yes,85,11,50,19,11,4,4,31,10,6,3,1,0,0,2,0,0,0

In [9]:
ch_val,P_val,nrow,EC=chi2_contingency(CT_hr)

In [10]:
print(P_val)

3.40833711883961e-09

In [11]:
# We are gettin the low p value hence we accept the H0 the Years with current manager is affecting the attrition.
# Maximum attrition happens with fresher as years increasing attrion level goes low but after 5 years it again increases

In [13]:
hr['EducationField'].value_counts()

1    606
2    464
3    159
4    132
6     82
5     27
Name: EducationField, dtype: int64

In [24]:
CT_hr1=pd.crosstab(hr['Attrition'],hr['EducationField'])
CT_hr1

EducationField    1    2    3    4   5   6
Attrition
No              517  401  124  100  20  71
Yes              89   63   35   32   7  11

In [17]:
ch_val,P_val,nrow,EC=chi2_contingency(CT_hr1)

In [18]:
print(P_val)

0.006773980139025222

In [19]:
def twosampz(x1,x2,n1,n2):
    p1=x1/n1
    p2=x2/n2
    pp=(x1+x2)/(n1+n2)
    zdata= (p1-p2)/np.sqrt((pp*(1-pp)*((1/n1)+(1/n2))))
    pval=2*(1-stats.norm.cdf(abs(zdata)))
    return round(zdata,3),round(pval,4)

In [20]:
z,p=twosampz(32,7,132,27)

In [21]:
p

0.853

In [22]:
# WE are getting a small P value hence we reject the null hypothesis hence education field has a significant influence on the 
# attrition.WE conclude that HR and marketing people mostly attriate

In [23]:
hr['YearsWithCurrManager'].value_counts()

2     344
0     263
7     216
3     142
8     107
4      98
1      76
9      64
5      31
6      29
10     27
11     22
12     18
13     14
17      7
14      5
15      5
16      2
Name: YearsWithCurrManager, dtype: int64

In [28]:
CT_hr2=pd.crosstab(hr['Attrition'],hr['NumCompaniesWorked'])
CT_hr2

NumCompaniesWorked    0    1    2    3    4   5   6   7   8   9
Attrition
No                  174  423  130  143  122  47  54  57  43  40
Yes                  23   98   16   16   17  16  16  17   6  12

In [33]:
ch_val,P_val,nrow,EC=chi2_contingency(CT_hr2)

In [27]:
print(P_val)

0.006773980139025222

In [29]:
#

In [30]:
hr['PercentSalaryHike'].value_counts()

11    210
13    209
14    201
12    198
15    101
18     89
17     82
16     78
19     76
22     56
20     55
21     48
23     28
24     21
25     18
Name: PercentSalaryHike, dtype: int64

In [32]:
CT_hr3=pd.crosstab(hr['Attrition'],hr['PercentSalaryHike'])
CT_hr3

PercentSalaryHike,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25
Attrition,,,,,,,,,,,,,,,
No,169,165,175,177,83,64,68,76,67,48,43,44,22,15,17
Yes,41,33,34,24,18,14,14,13,9,7,5,12,6,6,1

In [37]:
hr_gender= hr.groupby('Attrition')
A1=hr_gender.get_group('No')  
A2=hr_gender.get_group('Yes')

In [39]:
hr_G1=np.array(hr['PercentSalaryHike'])
hr_G2=np.array(hr['PercentSalaryHike'])

In [40]:
shapiro(hr_G1)

(0.9006035923957825, 7.476110216992445e-30)

In [43]:
bartlett(A1['PercentSalaryHike'],A2['PercentSalaryHike'])

BartlettResult(statistic=0.5008947485145456, pvalue=0.479107241084924)

In [44]:
p_val=ttest_ind(A1['PercentSalaryHike'],A2['PercentSalaryHike'])
p_val

Ttest_indResult(statistic=0.5164573250747643, pvalue=0.6056128238893757)

In [60]:
ratings=pd.read_csv('ratings.csv',header=None,sep ='::')

C:\Users\AKSHAY\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [61]:
ratings.head()

   0     1  2          3
0  1  1193  5  978300760
1  1   661  3  978302109
2  1   914  3  978301968
3  1  3408  4  978300275
4  1  2355  5  978824291

In [57]:
rating_columns=["a","b","c","d"]

In [58]:
ratings.columns = rating_columns

In [59]:
ratings.head()

   a     b  c          d
0  1   661  3  978302109
1  1   914  3  978301968
2  1  3408  4  978300275
3  1  2355  5  978824291
4  1  1197  3  978302268